Show / Hide Table of Contents
Class MatConcreteEc2
Material concrete Ec2
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatConcrete
MatConcreteEc2
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.ECEN.MatConcreteECEN,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatConcrete))]
public class MatConcreteEc2 : MatConcrete
Examples
This sample shows how to create concrete material.
//Creating the model
OpenModel openModel = new OpenModel();
//Cocrete material
MatConcreteEc2 mat = new MatConcreteEc2();
mat.Name = "Concrete1";
mat.UnitMass = 2500.0;
mat.E = 32.8e9;
mat.G = 13.667e9;
mat.Poisson = 0.2;
mat.SpecificHeat = 0.6;
mat.ThermalExpansion = 0.00001;
mat.ThermalConductivity = 45;
mat.Fck = 25.5e6;
mat.CalculateDependentValues = true;
//Set s-s diagram as a default parabolic
mat.DiagramType = ConcDiagramType.Parabolic;
//Set s-s diagram as an user defined
mat.DiagramType = ConcDiagramType.DefinedByUser;
var userDiagram = new Polygon2D();
mat.UserDiagram = userDiagram;
userDiagram.Points.Add(new Point2D() { X = -0.021, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.02, Y = 0 });
userDiagram.Points.Add(new Point2D() { X = -0.0025, Y = -80000000});
userDiagram.Points.Add(new Point2D() { X = -0.0024, Y = -79868660.43});
userDiagram.Points.Add(new Point2D() { X = -0.0023, Y = -79461961.9 });
userDiagram.Points.Add(new Point2D() { X = -0.0022, Y = -78762709.44});
userDiagram.Points.Add(new Point2D() { X = -0.0021, Y = -77756658.69});
userDiagram.Points.Add(new Point2D() { X = -0.0019, Y = -74785483.74	});
userDiagram.Points.Add(new Point2D() { X = -0.0017, Y = -70514061.33	});
userDiagram.Points.Add(new Point2D() { X = -0.0015, Y = -64981949.46	});
userDiagram.Points.Add(new Point2D() { X = -0.001	, Y = -46511627.91	});
userDiagram.Points.Add(new Point2D() { X = -0.0005, Y = -23904382.47	});
userDiagram.Points.Add(new Point2D() { X = 0, Y = 0});
userDiagram.Points.Add(new Point2D() { X = 0.001, Y = 0 });
//Setting thermal characteristcs of material (in this case by the code)
mat.StateOfThermalConductivity = ThermalConductivityState.Code;
mat.StateOfThermalExpansion = ThermalExpansionState.Code;
mat.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
mat.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(mat);
Properties
Improve this Doc   View Source
AggregateType
Type of aggregate
Declaration
public ConcAggregateType AggregateType { get; set; }
Property Value
 Type |  Description
 ConcAggregateType
Improve this Doc   View Source
CalculateDependentValues
Setting calculation dependent values on fck
Declaration
public bool CalculateDependentValues { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CementClass
Type of cement class
Declaration
public ConcCementClass CementClass { get; set; }
Property Value
 Type |  Description
 ConcCementClass
Improve this Doc   View Source
DiagramType
Type of stress-strain diagram bilinear/parabolic/general for ULS calculation
Declaration
public ConcDiagramType DiagramType { get; set; }
Property Value
 Type |  Description
 ConcDiagramType
Improve this Doc   View Source
Ecm
Secant modulus of elasticity of concrete - Ecm
Declaration
public double Ecm { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epsc1
Compressive strain in the concrete - εc1
Declaration
public double Epsc1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epsc2
Compressive strain in the concrete - εc2
Declaration
public double Epsc2 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epsc3
Compressive strain in the concrete - εc3
Declaration
public double Epsc3 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epscu1
Ultimate compressive strain in the concrete - εcu1
Declaration
public double Epscu1 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epscu2
Ultimate compressive strain in the concrete - εcu2
Declaration
public double Epscu2 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epscu3
Ultimate compressive strain in the concrete - εcu3
Declaration
public double Epscu3 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fck
Characteristic compressive cylinder strength of concrete at 28 days - fck
Declaration
public double Fck { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fcm
Mean value of concrete cylinder compressive strength - fcm
Declaration
public double Fcm { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fctk_0_05
Characteristic axial tensile strength of concrete 5% quantile - fctk,0,05
Declaration
public double Fctk_0_05 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fctk_0_95
Characteristic axial tensile strength of concrete 95% quantile - fctk,0,95
Declaration
public double Fctk_0_95 { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fctm
Mean value of axial tensile strength of concrete - fctm
Declaration
public double Fctm { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
NFactor
Coefficient n-factor - necessary parabolic part of stress-strain diagram - n
Declaration
public double NFactor { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
PlainConcreteDiagram
Stress strain diagram with tension part
Declaration
public bool PlainConcreteDiagram { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SilicaFume
Contains silica fume
Declaration
public bool SilicaFume { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
StoneDiameter
Diameter of stone
Declaration
public double StoneDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserDiagram
Stress-strain diagram defined by user
Declaration
public Polygon2D UserDiagram { get; set; }
Property Value
 Type |  Description
 Polygon2D
 Improve this Doc
 View Source